[graphicalobject]
Name=LReProcD
x=2
y=0
width=131
height=420
Help= ;
PosStyle=floatable
Activate=0
Z-Order=1
rc-dll=hpleo008.dll

[ToolDescriptor]
1=Start,pushbutton,hpgbut02.dll
2=Stop,pushbutton,hpgbut02.dll
3=SampleInfo,statuslist,hpgwct02.dll
!4=DiskSpace,statuslist,hpgwct02.dll
5=


[fontalias]
1=normal|ＭＳ Ｐゴシック,9,normal
2=bold|ＭＳ Ｐゴシック,9,bold
3=


[coloralias]
1=GRAY|192,192,192
2=RunColor|192,192,192
3=StopColor|192,192,192
;2=RunColor|0,128,128
;3=StopColor|223,0,0


[pushbutton Start]
;x=5
x=1
y=8
;width=55
width=67
height=30
Help=このボタンは、シングル データ リプロセスを開始します。
;ImageList=Start|Start|Start
ImageList=RBMP.Start|RBMP.Start|RBMP.Start|RBMP.Start
Command=GUIRunReprocessing
Font=bold
Color=RunColor


[pushbutton Stop]
;x=59
x=67
y=8
width=67
height=30
Help=このボタンは、シングル データ リプロセスを終了します。
;ImageList=Stop|Stop|Stop
ImageList=RBMP.Stop|RBMP.Stop|RBMP.Stop|RBMP.Stop
Command=HPLC.STOPMETHOD
Font=bold
Color=StopColor


[statuslist SampleInfo]
x=1
y=42
width=120
height=200
Help=サンプル情報。情報、データ ディレクトリ、シーケンス状況。
Cursor=Hand
Image1=BACKGROUND
x1=0
y1=0
ROP1=SRCCOPY
Image2=vial#
Image3=%.0f
value3=1
Image4=SampleName
Image5=Rawdatafile
Image6=Operator
Image7=aquiredon
Image8=MethodFile
x2=9
x3=70
x4=9
x5=100
x6=9
x7=9
x8=9
y2=110
y3=110
y4=130
y5=150
y6=170
y7=190
y8=210
justify5=Right
Font2=bold
Font3=bold
Font4=bold
Font5=bold
Font6=normal
Font7=normal
Font8=normal
BkColor=GRAY
RcDll=hpleo008.dll
RcDll1=hpleo008.dll
Symbols1=BACKGROUND
BackGround=RBMP.PICTURE_REPROCESS
Command=@view.floatingmenu "menu[1]", "SingleSample"


[statuslist DiskSpace]
x=8
y=342
width=120
height=22
Help=データ ドライブのフリー ディスク スペース情報。
Image1=BACKGROUND
x1=0
y1=0
ROP1=SRCCOPY
Image2=C: %.0fMB フリー
x2=29
y2=13
RcDll=hpleo008.dll
RcDll1=hpleo008.dll
Symbols1=BACKGROUND
BackGround=RBMP.DISKSPACE
Command=@view.floatingmenu "menu[1]", "DataDir"

